# BOJ 14499 주사위 굴리기

# 정 육면체
'''
주사위 전개도
[1, 2, 3, 4, 5, 6]
동쪽: 1
서쪽: 2
북쪽: 3
남쪽: 4
[1, 2, 3, 4, 5, 6]
동쪽: 1 => 4, 2 => 2, 3 => 1, 4 => 6, 5 => 5, 6 => 3
서쪽: 1 => 3, 2 => 2, 3 => 6, 4 => 1, 5 => 5, 6 => 4
북쪽: 1 => 5, 2 => 1, 3 => 3, 4 => 4, 5 => 6, 6 => 2
남쪽: 1 => 2, 2 => 6, 3 => 3, 4 => 4, 5 => 1, 6 => 5

주사위 이동 동선
[
    [4, 2, 1, 6, 5, 3],
    [3, 2, 6, 1, 5, 4],
    [5, 1, 3, 4, 6, 2],
    [2, 6, 3, 4, 1, 5]
]
'''

import sys
input = sys.stdin.readline
N, M, x, y, K = map(int, input().split())
map = [[map(int, input().split())] for i in range(N)]
command = list(map(int, input().split()))
